Revit 2027 API
Application.AllUsersAddinsLocation Property
 The folder location for .addin files for all users.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AllUsersAddinsLocation { get; }
Public ReadOnly Property AllUsersAddinsLocation As String
	Get
public:
property String^ AllUsersAddinsLocation {
	String^ get ();
}
member AllUsersAddinsLocation : string with get
Property Value
String
Remarks
 The path may not exist on the file system, but the property will still return the expected path.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace